Revit 2027 API
RebarTrimExtendData.CreateEndConstraint Method
 Creates a constraint for the end handle of the rebar. This constraint will be set preferred after the API execution is finished successfully.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CreateEndConstraint(
	IList<Reference> targetReferences,
	bool isConstraintToCover,
	double offsetValue
)
Public Function CreateEndConstraint (
	targetReferences As IList(Of Reference),
	isConstraintToCover As Boolean,
	offsetValue As Double
) As Boolean
public:
bool CreateEndConstraint(
	IList<Reference^>^ targetReferences,
	bool isConstraintToCover,
	double offsetValue
)
member CreateEndConstraint :
        targetReferences : IList<Reference> *
        isConstraintToCover : bool *
        offsetValue : float -> bool
Parameters
targetReferences IList<Reference>
 The references to which the rebar handle will be constrained. Will throw exception if it's empty or if it's anything but Face(s) from a structural that can host rebar.
isConstraintToCover Boolean
 If true the RebarConstraintType will be set to ToCover, otherwise RebarConstraintType will be set to FixedDistanceToHostFace.
offsetValue Double
 The distance from references to the rebar handle.
Return Value
Boolean
 Returns true if a start constraint can be created with the given references, false otherwise. The reference should be faces from structurals that can host rebar.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarTrimExtendData Class
Autodesk.Revit.DB.Structure Namespace